omerbguclu/Attiny88Workspace/libraries/RF24/RF24.cpp
/****************************************************************************/

void RF24::setPayloadSize(uint8_t size)
{
    // payload size must be in range [1, 32]
    payload_size = static_cast<uint8_t>(rf24_max(1, rf24_min(32, size)));

    // write static payload size setting for all pipes
    for (uint8_t i = 0; i < 6; ++i)
        write_register(static_cast<uint8_t>(RX_PW_P0 + i), payload_size);
}

/****************************************************************************/

uint8_t RF24::getPayloadSize(void)
{
    return payload_size;
}

/****************************************************************************/

#if !defined(MINIMAL)

// static const PROGMEM char rf24_datarate_e_str_0[] = "= 1 MBPS";
// static const PROGMEM char rf24_datarate_e_str_1[] = "= 2 MBPS";
// static const PROGMEM char rf24_datarate_e_str_2[] = "= 250 KBPS";
// static const PROGMEM char * const rf24_datarate_e_str_P[] = {
//   rf24_datarate_e_str_0,
//   rf24_datarate_e_str_1,
//   rf24_datarate_e_str_2,
// };
// static const PROGMEM char rf24_model_e_str_0[] = "nRF24L01";
// static const PROGMEM char rf24_model_e_str_1[] = "nRF24L01+";
// static const PROGMEM char * const rf24_model_e_str_P[] = {
//   rf24_model_e_str_0,
//   rf24_model_e_str_1,
// };
// static const PROGMEM char rf24_crclength_e_str_0[] = "= Disabled";
// static const PROGMEM char rf24_crclength_e_str_1[] = "= 8 bits";
// static const PROGMEM char rf24_crclength_e_str_2[] = "= 16 bits" ;
// static const PROGMEM char * const rf24_crclength_e_str_P[] = {
//   rf24_crclength_e_str_0,
//   rf24_crclength_e_str_1,
//   rf24_crclength_e_str_2,
// };
// static const PROGMEM char rf24_pa_dbm_e_str_0[] = "= PA_MIN";
// static const PROGMEM char rf24_pa_dbm_e_str_1[] = "= PA_LOW";
// static const PROGMEM char rf24_pa_dbm_e_str_2[] = "= PA_HIGH";
// static const PROGMEM char rf24_pa_dbm_e_str_3[] = "= PA_MAX";
// static const PROGMEM char * const rf24_pa_dbm_e_str_P[] = {
//   rf24_pa_dbm_e_str_0,
//   rf24_pa_dbm_e_str_1,
//   rf24_pa_dbm_e_str_2,
//   rf24_pa_dbm_e_str_3,
// };

//     #if defined(RF24_LINUX)
// static const char rf24_csn_e_str_0[] = "CE0 (PI Hardware Driven)";
// static const char rf24_csn_e_str_1[] = "CE1 (PI Hardware Driven)";
// static const char rf24_csn_e_str_2[] = "CE2 (PI Hardware Driven)";
// static const char rf24_csn_e_str_3[] = "Custom GPIO Software Driven";
// static const char * const rf24_csn_e_str_P[] = {
//   rf24_csn_e_str_0,
//   rf24_csn_e_str_1,
//   rf24_csn_e_str_2,
//   rf24_csn_e_str_3,
// };
//     #endif // defined(RF24_LINUX)

// static const PROGMEM char rf24_feature_e_str_on[] = "= Enabled";
// static const PROGMEM char rf24_feature_e_str_allowed[] = "= Allowed";
// static const PROGMEM char rf24_feature_e_str_open[] = " open ";
// static const PROGMEM char rf24_feature_e_str_closed[] = "closed";
// static const PROGMEM char * const rf24_feature_e_str_P[] = {
//     rf24_crclength_e_str_0,
//     rf24_feature_e_str_on,
//     rf24_feature_e_str_allowed,
//     rf24_feature_e_str_closed,
//     rf24_feature_e_str_open
// };

void RF24::printDetails(void)
{

    // #if defined(RF24_LINUX)
    // printf("================ SPI Configuration ================\n" );
    // uint8_t bus_ce = static_cast<uint8_t>(csn_pin % 10);
    // uint8_t bus_numb = static_cast<uint8_t>((csn_pin - bus_ce) / 10);
    // printf("CSN Pin\t\t= /dev/spidev%d.%d\n", bus_numb, bus_ce);
    // printf("CE Pin\t\t= Custom GPIO%d\n", ce_pin);
    // #endif
    // printf_P(PSTR("SPI Speedz\t= %d Mhz\n"), static_cast<uint8_t>(spi_speed / 1000000)); //Print the SPI speed on non-Linux devices
    // #if defined(RF24_LINUX)
    // printf("================ NRF Configuration ================\n");
    // #endif // defined(RF24_LINUX)

    // print_status(get_status());

    // print_address_register(PSTR("RX_ADDR_P0-1"), RX_ADDR_P0, 2);
    // print_byte_register(PSTR("RX_ADDR_P2-5"), RX_ADDR_P2, 4);
    // print_address_register(PSTR("TX_ADDR\t"), TX_ADDR);

    // print_byte_register(PSTR("RX_PW_P0-6"), RX_PW_P0, 6);
    // print_byte_register(PSTR("EN_AA\t"), EN_AA);
    // print_byte_register(PSTR("EN_RXADDR"), EN_RXADDR);
    // print_byte_register(PSTR("RF_CH\t"), RF_CH);
    // print_byte_register(PSTR("RF_SETUP"), RF_SETUP);
    // print_byte_register(PSTR("CONFIG\t"), NRF_CONFIG);
    // print_byte_register(PSTR("DYNPD/FEATURE"), DYNPD, 2);

    // printf_P(PSTR("Data Rate\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_datarate_e_str_P[getDataRate()])));
    // printf_P(PSTR("Model\t\t= "
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_model_e_str_P[isPVariant()])));
    // printf_P(PSTR("CRC Length\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_crclength_e_str_P[getCRCLength()])));
    // printf_P(PSTR("PA Power\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_pa_dbm_e_str_P[getPALevel()])));
    // printf_P(PSTR("ARC\t\t= %d\r\n"), getARC());
}

void RF24::printPrettyDetails(void) {

    // #if defined(RF24_LINUX)
    // printf("================ SPI Configuration ================\n");
    // uint8_t bus_ce = static_cast<uint8_t>(csn_pin % 10);
    // uint8_t bus_numb = static_cast<uint8_t>((csn_pin - bus_ce) / 10);
    // printf("CSN Pin\t\t\t= /dev/spidev%d.%d\n", bus_numb, bus_ce);
    // printf("CE Pin\t\t\t= Custom GPIO%d\n", ce_pin);
    // #endif
    // printf_P(PSTR("SPI Frequency\t\t= %d Mhz\n"), static_cast<uint8_t>(spi_speed / 1000000)); //Print the SPI speed on non-Linux devices
    // #if defined(RF24_LINUX)
    // printf("================ NRF Configuration ================\n");
    // #endif // defined(RF24_LINUX)

    // uint8_t channel = getChannel();
    // uint16_t frequency = static_cast<uint16_t>(channel + 2400);
    // printf_P(PSTR("Channel\t\t\t= %u (~ %u MHz)\r\n"), channel, frequency);

    // printf_P(PSTR("RF Data Rate\t\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_datarate_e_str_P[getDataRate()])));
    // printf_P(PSTR("RF Power Amplifier\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_pa_dbm_e_str_P[getPALevel()])));
    // printf_P(PSTR("RF Low Noise Amplifier\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_feature_e_str_P[(read_register(RF_SETUP) & 1) * 1])));
    // printf_P(PSTR("CRC Length\t\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_crclength_e_str_P[getCRCLength()])));
    // printf_P(PSTR("Address Length\t\t= %d bytes\r\n"), (read_register(SETUP_AW) & 3) + 2);
    // printf_P(PSTR("Static Payload Length\t= %d bytes\r\n"), getPayloadSize());

    // uint8_t setupRetry = read_register(SETUP_RETR);
    // printf_P(PSTR("Auto Retry Delay\t= %d microseconds\r\n"), (setupRetry >> ARD) * 250 + 250);
    // printf_P(PSTR("Auto Retry Attempts\t= %d maximum\r\n"), setupRetry & 0x0F);

    // uint8_t observeTx = read_register(OBSERVE_TX);
    // printf_P(PSTR("Packets lost on\n    current channel\t= %d\r\n"), observeTx >> 4);
    // printf_P(PSTR("Retry attempts made for\n    last transmission\t= %d\r\n"), observeTx & 0x0F);

    // uint8_t features = read_register(FEATURE);
    // printf_P(PSTR("Multicast\t\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(features & _BV(EN_DYN_ACK)) * 2])));
    // printf_P(PSTR("Custom ACK Payload\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(features & _BV(EN_ACK_PAY)) * 1])));

    // uint8_t dynPl = read_register(DYNPD);
    // printf_P(PSTR("Dynamic Payloads\t"
    // PRIPSTR
    // "\r\n"), (char *)(pgm_read_ptr(&rf24_feature_e_str_P[(dynPl && (features &_BV(EN_DPL))) * 1])));

